#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    setlocale(LC_ALL, ".65001");

    int a[7];
    //2 5 6 3 7 1 9

    for (int i = 0; i < 7; i++)
    {
        cin >> a[i];
    }

    // Алгоритм сортировки методом выбора
    cout << "Процесс сортировки: " << endl;
    for(int i = 0; i < 7; i++)
    {
        int min_a = 1000000000; //задаем минимальный элемент так, 
                              // чтобы он был больше самого большого числа нашего массива
        int ind_min = 0; // индекс числа с которым мы будем менять текущий элемент 
        int y = a[i]; // запоминаем текущий неотсортированный элемент

        // находим минимальный элемент неотсортированной части
        for(int j = i; j < 7; j++)
        {
            if (a[j] < min_a)
            {
                min_a = a[j];
                ind_min = j;
            }
        }
        // меняем местами минимальный и текущий элемент
        a[ind_min] = y;
        a[i] = min_a;

        // выводим для наглядности
        for (int i = 0; i < 7; i++)
        {
            cout << a[i] << " ";
        }
        cout << endl;
    }

    // Вывод отсортированного массива
    cout << "Отсортированный массив: " << endl;
    for (int i = 0; i < 7; i++)
    {
        cout << a[i] << " ";
    }
    cout << endl;

    return 0;
}