#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    setlocale(LC_ALL, ".65001");

    int a[7];
    //2 5 6 3 7 1 9
    int y;

    for (int i = 0; i < 7; i++)
    {
        cin >> a[i];
    }

    // Алгоритм сортировки методом выбора
    cout << "Процесс сортировки: " << endl;
    for(int i = 0; i < 6; i++)
    {
        for(int j = 6; j > i; j--)
        {
            if(a[j] < a[j-1])
            {
                // Меняем элементы местами до тех пор пока минимальный не встанет в начало
                y = a[j];
                a[j] = a[j-1];
                a[j-1] = y;
            }
        }

        //Вывод для наглядности
        for (int i = 0; i < 7; i++)
        {
            cout << a[i] << " ";
        }
        cout << endl;
    }

    // Вывод отсортированного массива
    cout << "Отсортированный массив: " << endl;
    for (int i = 0; i < 7; i++)
    {
        cout << a[i] << " ";
    }
    cout << endl;

    return 0;
}
/*
2 5 6 3 7 1 9
Процесс сортировки: 
1 2 5 6 3 7 9 
1 2 3 5 6 7 9 
1 2 3 5 6 7 9 
1 2 3 5 6 7 9 
1 2 3 5 6 7 9 
1 2 3 5 6 7 9 
Отсортированный массив: 
1 2 3 5 6 7 9 
*/




/*
    for (int i = 0; i < 6; i++) 
    {
        for (int j = 0; j < 6 - i; j++) 
        {
            if (a[j] > a[j + 1]) {
                // Меняем элементы местами
                int y = a[j];
                a[j] = a[j + 1];
                a[j + 1] = y;
            
            }
        }

        //Вывод для наглядности
        for (int i = 0; i < 7; i++)
        {
            cout << a[i] << " ";
        }
        cout << endl;
    }

2 5 6 3 7 1 9
Процесс сортировки: 
2 5 3 6 1 7 9 
2 3 5 1 6 7 9 
2 3 1 5 6 7 9 
2 1 3 5 6 7 9 
1 2 3 5 6 7 9 
1 2 3 5 6 7 9 
Отсортированный массив: 
1 2 3 5 6 7 9 
*/